<?php
/**
 * The template for displaying archive pages
 *
 * @link https://developer.wordpress.org/themes/basics/template-hierarchy/
 *
 * @package Theme
 */

get_header();
?>

<?php
// создаем экземпляр
$my_posts = new WP_Query;

// делаем запрос
$reviews = $my_posts->query([
	'post_type' => 'reviews'
]);



?>

<main id="primary" class="archive">
	<div class="container">
		<?php render_breads(); ?>
		<div class="reviews__wrapper">
			<h1 class="page-title reviews__page-title">
				Отзывы
			</h1>
			<button data-modal data-src="#modal-review" class="btn invert">
				Оставить отзыв
			</button>
		</div>
		<?php if (!empty($reviews)): { ?>


			<?php }endif ?>

		<?php
		if (have_posts()): ?>
			<div class="reviews__list archive-holder">
				<?php while (have_posts()):
					the_post(); ?>
					<div class=" reviews__item">
						<?php
						$item = $post;
						$date = str_replace('/', '.', get_field('date', $item));
						$gallery = get_field('gallery', $item)
							?>
						<div class="reviews__top">
							<div class="reviews__top-text">
								<div class="h6 reviews__top-title">
									<?= $item->post_title ?>
								</div>
								<?php if(!empty($date)) { ?>
									<p class="p2 reviews__top-date">
										<?= $date ?>
									</p>
								<?php } ?>
							</div>
						</div>
						<?php if(!empty($item->post_content)) { ?>
							<div class="reviews__content">
								<?= $item->post_content; ?>
							</div>
						<?php } ?>
						<a class="reviews__btn-more h6">Читать полностью</a>
						<?php if (!empty($gallery)): { ?>
								<div class="reviews__gallery">
									<?php foreach ($gallery as $id => $item): ?>
										<a href="<?= $item ?>" data-fancybox="gallery-<?=get_the_ID()?>" class="reviews__gallery-item">
											<img src="<?= $item ?>" alt="img">
										</a>
									<?php endforeach ?>
								</div>
							<?php }endif ?>
					</div>
				<?php endwhile;
				?>
			</div> <?php
		else:
			echo '<p>Отзывы пока отсутствуют.</p>';
		endif;
		?>


		<div class="pagination">
			<?php
			the_posts_pagination(array(
				'mid_size' => 2, // Количество ссылок вокруг текущей
				'prev_text' => __('<svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
<g clip-path="url(#clip0_628_267)">
<path d="M0.656489 7.39079L7.18529 0.861832C7.34406 0.709355 7.55628 0.625198 7.77641 0.627424C7.99653 0.62965 8.207 0.718083 8.36266 0.87374C8.51832 1.0294 8.60675 1.23987 8.60898 1.45999C8.6112 1.68012 8.52705 1.89234 8.37457 2.05111L3.28113 7.14535L14.7701 7.14535C14.9911 7.1484 15.2021 7.23835 15.3573 7.39575C15.5126 7.55314 15.5996 7.76532 15.5996 7.98639C15.5996 8.20746 15.5126 8.41964 15.3573 8.57704C15.2021 8.73443 14.9911 8.82438 14.7701 8.82743L3.28113 8.82743L8.37441 13.9214C8.45511 13.9989 8.51954 14.0917 8.56392 14.1944C8.6083 14.2971 8.63174 14.4076 8.63288 14.5195C8.63401 14.6314 8.61281 14.7424 8.57051 14.846C8.52822 14.9496 8.46568 15.0437 8.38656 15.1228C8.30744 15.2019 8.21334 15.2644 8.10975 15.3067C8.00616 15.349 7.89518 15.3702 7.78329 15.3691C7.67141 15.368 7.56088 15.3445 7.45817 15.3001C7.35545 15.2558 7.26263 15.1913 7.18513 15.1106L0.65633 8.58151C0.616809 8.54215 0.58145 8.49879 0.55073 8.45239C0.53777 8.43255 0.52833 8.41031 0.51713 8.38999C0.50145 8.36279 0.48737 8.33479 0.475049 8.30599C0.46465 8.27847 0.456009 8.25047 0.448969 8.22183C0.441929 8.19751 0.432169 8.17383 0.427209 8.14871C0.405609 8.03991 0.405609 7.92807 0.427209 7.81943C0.432169 7.79415 0.441929 7.77111 0.448969 7.74663C0.456005 7.71815 0.464714 7.6901 0.475049 7.66263C0.48737 7.63383 0.50145 7.60567 0.51713 7.57847C0.52833 7.55783 0.53777 7.53639 0.55073 7.51607C0.581882 7.47111 0.61724 7.42922 0.656329 7.39095L0.656489 7.39079Z" fill="#0054F5"/>
</g>
<defs>
<clipPath id="clip0_628_267">
<rect width="16" height="16" fill="white"/>
</clipPath>
</defs>
</svg>
'), // Текст для кнопки "Назад"
				'next_text' => __('<svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
<g clip-path="url(#clip0_628_159)">
<path d="M15.3543 8.60579L8.82545 15.1348C8.66668 15.2872 8.45446 15.3714 8.23433 15.3692C8.01421 15.3669 7.80374 15.2785 7.64808 15.1228C7.49242 14.9672 7.40399 14.7567 7.40176 14.5366C7.39954 14.3165 7.4837 14.1042 7.63617 13.9455L12.7296 8.85123H1.24065C1.0196 8.84818 0.808642 8.75823 0.653404 8.60084C0.498166 8.44344 0.411133 8.23126 0.411133 8.01019C0.411133 7.78912 0.498166 7.57694 0.653404 7.41954C0.808642 7.26215 1.0196 7.1722 1.24065 7.16915H12.7296L7.63633 2.07523C7.55563 1.99773 7.4912 1.90491 7.44682 1.80219C7.40244 1.69948 7.379 1.58895 7.37787 1.47707C7.37673 1.36518 7.39794 1.2542 7.44023 1.15061C7.48253 1.04702 7.54506 0.952917 7.62418 0.8738C7.7033 0.794682 7.79741 0.732145 7.90099 0.68985C8.00458 0.647555 8.11557 0.626353 8.22745 0.627484C8.33933 0.628616 8.44987 0.652059 8.55258 0.69644C8.65529 0.740821 8.74811 0.805249 8.82561 0.88595L15.3544 7.41507C15.3939 7.45443 15.4293 7.49779 15.46 7.54419C15.473 7.56403 15.4824 7.58627 15.4936 7.60659C15.5093 7.63379 15.5234 7.66179 15.5357 7.69059C15.5461 7.71811 15.5547 7.74611 15.5618 7.77475C15.5688 7.79907 15.5786 7.82275 15.5835 7.84787C15.6051 7.95667 15.6051 8.06851 15.5835 8.17715C15.5786 8.20243 15.5688 8.22547 15.5618 8.24995C15.5547 8.27844 15.546 8.30649 15.5357 8.33395C15.5234 8.36275 15.5093 8.39091 15.4936 8.41811C15.4824 8.43875 15.473 8.46019 15.46 8.48051C15.4289 8.52547 15.3935 8.56737 15.3544 8.60563L15.3543 8.60579Z" fill="#0054F5"/>
</g>
<defs>
<clipPath id="clip0_628_159">
<rect width="16" height="16" fill="white"/>
</clipPath>
</defs>
</svg>
'), // Текст для кнопки "Вперед"
			));
			?>
		</div>

	</div>

</main><!-- #main -->

<?php
// get_sidebar();
get_footer();
